reference/openfoam/compressible_lid_driven_cavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     rhoCentralFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         0.05;

deltaT          5e-4;

writeControl    timeStep;
writeInterval   100;
purgeWrite      0;

writeFormat     ascii;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   10;

runTimeModifiable false;

adjustTimeStep  no;

functions
{
    probesAll
    {
        #include "probes_all.cfg"
    }
}

