reference/openfoam/compressible_lid_driven_cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

// Same geometry/mesh as `incompressible_lid_driven_cavity`.

vertices
(
    (0    0    0)
    (1    0    0)
    (1    1    0)
    (0    1    0)
    (0    0    0.01)
    (1    0    0.01)
    (1    1    0.01)
    (0    1    0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    left
    {
        type wall;
        faces ((0 3 7 4));
    }
    right
    {
        type wall;
        faces ((1 5 6 2));
    }
    bottom
    {
        type wall;
        faces ((0 4 5 1));
    }
    lid
    {
        type wall;
        faces ((3 2 6 7));
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
        );
    }
);

mergePatchPairs ();
